import re
from tqdm import tqdm

def remove_proNone(text):
    proNoneList=[
        "در",
        "به",
        "از",
        "که",
        "این",
        "با",
        "می",
        "نیز",
        "تا",
        "ما",
        "باید",
        "اند",
        "هم",
        "همچنین",
        "برای",
        "ها",
        "آن",
        "وی",
        "یک",
        "خود",
        "بر",
        "دو",
        "آنها",
        "اما",
        "دیگر",
        "اگر"
        "را",
        "های",
        "و",
        "نمی",
        "هر",
        "ای",
        "زیر",
        "البته",
        "بدین",
        "چون",
        "زیرا",
        "فراوان",
        "اند",
        "اییم",
        "اید",
        "براساس",
        "قبلا",
        "یک",
        "ان",
        "بسیار",
        "ما",
        "شما"
        ]
 
        
    for key in tqdm(proNoneList):
        reText = r'([\s])(['+key+']+)([\W\d\s]+)'
        text = re.sub(reText, r' \3', text)
        
    return text